int solution(int a, int b, int n) { //a는 가져다 줘야하는 빈병 개수, b는 받는 콜라병 개수
    //n은 현재 내 콜라 개수
    int sum=0; //총 받는 콜라 개수
    int x = 0; // 마트에 줄 빈 콜라병 개수
    int y = 0; // 다시 받아오는 콜라병 개수
    while (n >= a) {
        //20개를 3으로 나눠 (n을 a로 나눠) 그러면 내 콜라는 2개가 되고, 받는 콜라는 20/3(즉 6)
        x = (n/a) * b; //마트에게서 받은 콜라의 개수 : 20/3; -> 6병을 마트에 줄 수 있음, 8/3 ->2, 4/3-> 1,
        y = n%a; //나에게 남은 새삥 콜라 개수 : 20% 3; -> 2 , 8%3 ->2, 4%3-> 1
        n = x+y; //-> 8이 됨 
        // 8이 3보다 크니까 다시 루프 , 4가되고 3보다 크니까 다시 루프 , 2가 3보다 작으니까 이젠 루프 못 돌림
        sum = sum + x;
    }
  
    return sum;
}